/*********************************************************************************************************
* 模块名称：PackUnpack.h
* 摘    要：PackUnpack模块
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容： 
* 修改文件： 
*********************************************************************************************************/
#ifndef _PACK_UNPACK_H_
#define _PACK_UNPACK_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"
#include "UART1.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
//包类型结构体
typedef struct
{
  u8 packModuleId;    //模块包ID
  u8 packHead;        //数据头
  u8 packSecondId;    //二级ID
  u8 arrData[6];      //包数据
  u8 checkSum;        //校验和
}StructPackType;

//枚举定义，定义模块ID，0x00～0x7F，不可以重复
typedef enum
{
  MODULE_SYS     = 0x01,  //系统信息
  MODULE_WAVE     = 0x10,  //波形数据
  MODULE_PARAM    = 0x11,  //参数数据
  MODULE_STATUS    = 0x12,  //状态数据

  MAX_MODULE_ID  = 0x80
}EnumPackID;

//定义二级ID，0x00～0xFF，因为是分属于不同的模块ID，因此不同模块ID的二级ID可以重复
//系统信息的二级ID
typedef enum 
{
  DAT_SYS_VERSION = 0x01,         //系统版本信息
  DAT_SYS_TIME    = 0x02,         //系统运行时间
  DAT_SELF_CHECK  = 0x03,         //系统自检结果
  DAT_CMD_ACK     = 0x04,         //命令应答
  
  CMD_GET_VERSION_ACK = 0x80,     //获取系统版本信息应答
  CMD_GET_TIME_ACK    = 0x81,     //获取系统运行时间应答
}EnumSysSecondID;

//波形数据的二级ID
typedef enum
{
  ID2_WAVE = 0x02,         //波形数据 TODO:没有实际定义
}EnumWaveSecondID;

//参数数据的二级ID
typedef enum
{
  ID2_PARAM = 0x02,         //参数数据
}EnumParamSecondID;

//状态数据的二级ID
typedef enum
{
  ID2_STATUS = 0x02,         //状态数据
}EnumStatusSecondID;
  
/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void  InitPackUnpack(void);               //初始化PackUnpack模块
u8    PackData(StructPackType* pPT);      //对数据进行打包，1-打包成功，0-打包失败
u8    UnPackData(u8 data);                //对数据进行解包，1-解包成功，0-解包失败

StructPackType  GetUnPackRslt(void);      //读取解包后数据包

#endif
