/*********************************************************************************************************
* 模块名称：SendDataToHost.c
* 摘    要：SendDataToHost模块
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日 
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "SendDataToHost.h"
#include "PackUnpack.h"
#include "UART1.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
 
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void  SendPackToHost(StructPackType* pPackSent);  //打包数据，并将数据发送到主机

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：SendPackToHost
* 函数功能：打包数据，并将数据发送到主机
* 输入参数：pPackSent，指向结构体变量的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
static  void  SendPackToHost(StructPackType* pPackSent)
{
  u8  packValid = 0;  //打包正确标志位，默认值为0

  packValid = PackData(pPackSent);  //打包数据
  
  if(0 < packValid)                 //如果打包正确
  {
    WriteUART1((u8*)pPackSent, 10); //写数据到串口
  }
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitSendDataToHost
* 函数功能：初始化SendDataToHost模块 
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  InitSendDataToHost(void)
{
  
}

/*********************************************************************************************************
* 函数名称：SendAckPack
* 函数功能：发送命令应答数据包到主机
* 输入参数：moduleId为模块ID，secondId为二级ID，ackMsg为应答消息
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void SendAckPack(u8 moduleId, u8 secondId, u8 ackMsg)
{
  StructPackType pt;  //包结构体变量

  pt.packModuleId = MODULE_SYS;   //系统信息模块的模块ID
  pt.packSecondId = DAT_CMD_ACK;  //系统信息模块的二级ID
  pt.arrData[0] = moduleId; //模块ID       
  pt.arrData[1] = secondId; //二级ID
  pt.arrData[2] = ackMsg;   //应答消息
  pt.arrData[3] = 0;  //保留
  pt.arrData[4] = 0;  //保留
  pt.arrData[5] = 0;  //保留

  SendPackToHost(&pt);//打包数据，并将数据发送到主机
}

/*********************************************************************************************************
* 函数名称：SendWaveToHost
* 函数功能：发送打包好的波形数据包到主机，一次性发送5个点
* 输入参数：pWaveData-波形数据存放的地址，每个波形点取值范围为0～255
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  SendWavePackHost(u8* pWaveData)
{
  StructPackType  pt; //包结构体变量
  
  pt.packModuleId = MODULE_WAVE;    //波形数据模块的模块ID
  pt.packSecondId = ID2_WAVE; //波形数据模块的二级ID
  pt.arrData[0] = pWaveData[0]; //心电数据高位
  pt.arrData[1] = pWaveData[1]; //心电数据低位
  pt.arrData[2] = pWaveData[2]; //呼吸数据高位
  pt.arrData[3] = pWaveData[3]; //呼吸数据低位
  pt.arrData[4] = pWaveData[4]; //SPO2数据高位
  pt.arrData[5] = pWaveData[5]; //SPO2数据低位

  SendPackToHost(&pt);  //打包数据，并将数据发送到主机
}

/*********************************************************************************************************
* 函数名称：SendParamToHost
* 函数功能：发送打包好的参数数据包到主机
* 输入参数：pParamData-参数数据存放的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  SendParamPackHost(u8* pParamData)
{
  StructPackType  pt; //包结构体变量
  
  pt.packModuleId = MODULE_PARAM;    //参数数据模块的模块ID
  pt.packSecondId = ID2_PARAM;  //参数数据模块的二级ID
  pt.arrData[0] = pParamData[0]; //心率高位
  pt.arrData[1] = pParamData[1]; //心率低位
  pt.arrData[2] = pParamData[2]; //呼吸率高位
  pt.arrData[3] = pParamData[3]; //呼吸率低位
  pt.arrData[4] = pParamData[4]; //SPO2高位
  pt.arrData[5] = pParamData[5]; //SPO2低位

  SendPackToHost(&pt);  //打包数据，并将数据发送到主机
}


/*********************************************************************************************************
* 函数名称：SendStatusToHost
* 函数功能：发送打包好的状态数据包到主机
* 输入参数：pStatusData-状态数据存放的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void  SendStatusPackHost(u8* pStatusData)
{
  StructPackType  pt; //包结构体变量
  
  pt.packModuleId = MODULE_STATUS;    //状态数据模块的模块ID
  pt.packSecondId = ID2_STATUS;  //状态数据模块的二级ID
  pt.arrData[0] = pStatusData[0]; //ECG导联状态      0-导联脱落，1-导联正常
  pt.arrData[1] = pStatusData[1]; //ECG异常报警状态   0-无报警，1-心率过高报警，2-心率过低报警
  pt.arrData[2] = pStatusData[2]; //RESP导联状态     0-导联脱落，1-导联正常
  pt.arrData[3] = pStatusData[3]; //RESP异常报警状态  0-无报警，1-呼吸率过高报警，2-呼吸率过低报警
  pt.arrData[4] = pStatusData[4]; //SPO2导联状态     0-正常，1-异常
  pt.arrData[5] = pStatusData[5]; //SPO2异常报警状态  0-无报警，1-SPO2过高报警，2-SPO2过低报警

  SendPackToHost(&pt);  //打包数据，并将数据发送到主机
}
